Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وجعلنا نومكم سباتا
en: And have appointed your sleep for repose,

source: وجعلنا الليل لباسا
en: And have appointed the night as a cloak,

source: وجعلنا النهار معاشا
en: And have appointed the day for livelihood.

source: وبنينا فوقكم سبعا شدادا
en: And We have built above you seven strong (heavens),

source: وجعلنا سراجا وهاجا
en: And have appointed a dazzling lamp,

source: وأنزلنا من المعصرات ماء ثجاجا
en: And have sent down from the rainy clouds abundant water,

source: لنخرج به حبا ونباتا
en: Thereby to produce grain and plant,

source: وجنات ألفافا
en: And gardens of thick foliage.

source: إن يوم الفصل كان ميقاتا
en: Lo! the Day of Decision is a fixed time,

source: يوم ينفخ في الصور فتأتون أفواجا
en: A day when the trumpet is blown and ye come in multitudes,

source: وفتحت السماء فكانت أبوابا
en: And the heaven is opened and becometh as gates,

source: وسيرت الجبال فكانت سرابا
en: And the hills are set in motion and become as a mirage.

source: إن جهنم كانت مرصادا
en: Lo! hell lurketh in ambush,

source: للطاغين مآبا
en: A home for the rebellious.

source: لابثين فيها أحقابا
en: They will abide therein for ages.

source: لا يذوقون فيها بردا ولا شرابا
en: Therein taste they neither coolness nor (any) drink

source: إلا حميما وغساقا
en: Save boiling water and a paralysing cold:

source: جزاء وفاقا
en: Reward proportioned (to their evil deeds).

source: إنهم كانوا لا يرجون حسابا
en: For lo! they looked not for a reckoning;

source: وكذبوا بآياتنا كذابا
en: They called Our revelations false with strong denial.

source: وكل شيء أحصيناه كتابا
en: Everything have We recorded in a Book.

source: فذوقوا فلن نزيدكم إلا عذابا
en: So taste (of that which ye have earned). No increase do We give you save of torment.

source: إن للمتقين مفازا
en: Lo! for the duteous is achievement -

source: حدائق وأعنابا
en: Gardens enclosed and vineyards,

source: وكواعب أترابا
en: And voluptuous women of equal age;

source: وكأسا دهاقا
en: And a full cup.

source: لا يسمعون فيها لغوا ولا كذابا
en: There hear they never vain discourse, nor lying -

source: جزاء من ربك عطاء حسابا
en: Requital from thy Lord - a gift in payment -

source: رب السماوات والأرض وما بينهما الرحمن لا يملكون منه خطابا
en: Lord of the heavens and the earth, and (all) that is between them, the Beneficent; with Whom none can converse.

source: يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا
en: On the day when the angels and the Spirit stand arrayed, they speak not, saving him whom the Beneficent alloweth and who speaketh right.

source: ذلك اليوم الحق فمن شاء اتخذ إلى ربه مآبا
en: That is the True Day. So whoso will should seek recourse unto his Lord.

source: إنا أنذرناكم عذابا قريبا يوم ينظر المرء ما قدمت يداه ويقول الكافر يا ليتني كنت ترابا
en: Lo! We warn you of a doom at hand, a day whereon a man will look on that which his own hands have sent before, and the disbeliever will cry: "Would that I were dust!"

source: والنازعات غرقا
en: By those who drag forth to destruction,

source: والناشطات نشطا
en: By the meteors rushing,

source: والسابحات سبحا
en: By the lone stars floating,

source: فالسابقات سبقا
en: By the angels hastening,

source: فالمدبرات أمرا
en: And those who govern the event,

source: يوم ترجف الراجفة
en: On the day when the first trump resoundeth.

source: تتبعها الرادفة
en: And the second followeth it,

source: قلوب يومئذ واجفة
en: On that day hearts beat painfully

source: أبصارها خاشعة
en: While eyes are downcast

source: يقولون أإنا لمردودون في الحافرة
en: (Now) they are saying: Shall we really be restored to our first state

source: أإذا كنا عظاما نخرة
en: Even after we are crumbled bones?

source: قالوا تلك إذا كرة خاسرة
en: They say: Then that would be a vain proceeding.

source: فإنما هي زجرة واحدة
en: Surely it will need but one shout,

source: فإذا هم بالساهرة
en: And lo! they will be awakened.

source: هل أتاك حديث موسى
en: Hath there come unto thee the history of Moses?

source: إذ ناداه ربه بالواد المقدس طوى
en: How his Lord called him in the holy vale of Tuwa,

source: فقل هل لك إلى أن تزكى
en: And say (unto him): Hast thou (will) to grow (in grace)?

source: وأهديك إلى ربك فتخشى
en: Then I will guide thee to thy Lord and thou shalt fear (Him).

source: فأراه الآية الكبرى
en: And he showed him the tremendous token.

source: فكذب وعصى
en: But he denied and disobeyed,

source: ثم أدبر يسعى
en: Then turned he away in haste,

source: فحشر فنادى
en: Then gathered he and summoned

source: فقال أنا ربكم الأعلى
en: And proclaimed: "I (Pharaoh) am your Lord the Highest."

source: فأخذه الله نكال الآخرة والأولى
en: So Allah seized him (and made him) an example for the after (life) and for the former.

source: إن في ذلك لعبرة لمن يخشى
en: Lo! herein is indeed a lesson for him who feareth.

source: أأنتم أشد خلقا أم السماء بناها
en: Are ye the harder to create, or is the heaven that He built?

source: رفع سمكها فسواها
en: He raised the height thereof and ordered it;

source: وأغطش ليلها وأخرج ضحاها
en: And He made dark the night thereof, and He brought forth the morn thereof.

source: والأرض بعد ذلك دحاها
en: And after that He spread the earth,

source: أخرج منها ماءها ومرعاها
en: And produced therefrom the water thereof and the pasture thereof,

source: والجبال أرساها
en: And He made fast the hills,

source: متاعا لكم ولأنعامكم
en: A provision for you and for your cattle.

source: فإذا جاءت الطامة الكبرى
en: But when the great disaster cometh,

source: يوم يتذكر الإنسان ما سعى
en: The day when man will call to mind his (whole) endeavour,

source: وبرزت الجحيم لمن يرى
en: And hell will stand forth visible to him who seeth,

source: فأما من طغى
en: Then, as for him who rebelled

source: وآثر الحياة الدنيا
en: And chose the life of the world,

source: فإن الجحيم هي المأوى
en: Lo! hell will be his home.

source: وأما من خاف مقام ربه ونهى النفس عن الهوى
en: But as for him who feared to stand before his Lord and restrained his soul from lust,

source: فإن الجنة هي المأوى
en: Lo! the Garden will be his home.

source: يسألونك عن الساعة أيان مرساها
en: They ask thee of the Hour: when will it come to port?

source: فيم أنت من ذكراها
en: Why (ask they)? What hast thou to tell thereof?

source: إلى ربك منتهاها
en: Unto thy Lord belongeth (knowledge of) the term thereof.

source: إنما أنت منذر من يخشاها
en: Thou art but a warner unto him who feareth it.

source: كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها
en: On the day when they behold it, it will be as if they had but tarried for an evening or the morn thereof.

source: عبس وتولى
en: He frowned and turned away

source: أن جاءه الأعمى
en: Because the blind man came unto him.

source: وما يدريك لعله يزكى
en: What could inform thee but that he might grow (in grace)

source: أو يذكر فتنفعه الذكرى
en: Or take heed and so the reminder might avail him?

source: أما من استغنى
en: As for him who thinketh himself independent,

source: فأنت له تصدى
en: Unto him thou payest regard.

source: وما عليك ألا يزكى
en: Yet it is not thy concern if he grow not (in grace).

source: وأما من جاءك يسعى
en: But as for him who cometh unto thee with earnest purpose

source: وهو يخشى
en: And hath fear,

source: فأنت عنه تلهى
en: From him thou art distracted.

source: كلا إنها تذكرة
en: Nay, but verily it is an Admonishment,

source: في صحف مكرمة
en: On honoured leaves

source: مرفوعة مطهرة
en: Exalted, purified,

source: بأيدي سفرة
en: (Set down) by scribes

source: كرام بررة
en: Noble and righteous.

source: قتل الإنسان ما أكفره
en: Man is (self-)destroyed: how ungrateful!

source: من أي شيء خلقه
en: From what thing doth He create him?

source: من نطفة خلقه فقدره
en: From a drop of seed. He createth him and proportioneth him,

source: ثم السبيل يسره
en: Then maketh the way easy for him,

source: ثم أماته فأقبره
en: Then causeth him to die, and burieth him;

source: ثم إذا شاء أنشره
en: Then, when He will, He bringeth him again to life.

source: كلا لما يقض ما أمره
en: Nay, but (man) hath not done what He commanded him.

source: فلينظر الإنسان إلى طعامه
en: Let man consider his food:

source: أنا صببنا الماء صبا
en: How We pour water in showers

source: ثم شققنا الأرض شقا
en: Then split the earth in clefts

source: فأنبتنا فيها حبا
en: And cause the grain to grow therein

source: وعنبا وقضبا
en: And grapes and green fodder

source: وزيتونا ونخلا
en: And olive-trees and palm-trees

source: وحدائق غلبا
en: And garden-closes of thick foliage

source: وفاكهة وأبا
en: And fruits and grasses:

source: فإذا جاءت الصاخة
en: But when the Shout cometh

source: يوم يفر المرء من أخيه
en: On the day when a man fleeth from his brother

source: وأمه وأبيه
en: And his mother and his father

source: وصاحبته وبنيه
en: And his wife and his children,

source: لكل امرئ منهم يومئذ شأن يغنيه
en: Every man that day will have concern enough to make him heedless (of others).

source: وجوه يومئذ مسفرة
en: On that day faces will be bright as dawn,

source: ضاحكة مستبشرة
en: Laughing, rejoicing at good news;

source: ووجوه يومئذ عليها غبرة
en: And other faces, on that day, with dust upon them,

source: ترهقها قترة
en: Veiled in darkness,

source: أولئك هم الكفرة الفجرة
en: Those are the disbelievers, the wicked.

source: إذا الشمس كورت
en: When the sun is overthrown,

source: وإذا النجوم انكدرت
en: And when the stars fall,

source: وإذا الجبال سيرت
en: And when the hills are moved,

source: وإذا العشار عطلت
en: And when the camels big with young are abandoned,

source: وإذا الوحوش حشرت
en: And when the wild beasts are herded together,

source: وإذا البحار سجرت
en: And when the seas rise,

source: وإذا النفوس زوجت
en: And when souls are reunited,

source: وإذا الموءودة سئلت
en: And when the girl-child that was buried alive is asked

source: بأي ذنب قتلت
en: For what sin she was slain,

source: وإذا الصحف نشرت
en: And when the pages are laid open,

source: وإذا السماء كشطت
en: And when the sky is torn away,

source: وإذا الجحيم سعرت
en: And when hell is lighted,

source: وإذا الجنة أزلفت
en: And when the Garden is brought nigh,

source: علمت نفس ما أحضرت
en: (Then) every soul will know what it hath made ready.

source: فلا أقسم بالخنس
en: Oh, but I call to witness the planets,

source: الجوار الكنس
en: The stars which rise and set,

source: والليل إذا عسعس
en: And the close of night,

source: والصبح إذا تنفس
en: And the breath of morning

source: ذي قوة عند ذي العرش مكين
en: Mighty, established in the presence of the Lord of the Throne,

source: مطاع ثم أمين
en: (One) to be obeyed, and trustworthy;

source: وما صاحبكم بمجنون
en: And your comrade is not mad.

source: ولقد رآه بالأفق المبين
en: Surely he beheld Him on the clear horizon.

source: وما هو على الغيب بضنين
en: And he is not avid of the Unseen.

source: وما هو بقول شيطان رجيم
en: Nor is this the utterance of a devil worthy to be stoned.

source: فأين تذهبون
en: Whither then go ye?

source: لمن شاء منكم أن يستقيم
en: Unto whomsoever of you willeth to walk straight.

source: وما تشاءون إلا أن يشاء الله رب العالمين
en: And ye will not, unless (it be) that Allah willeth, the Lord of Creation.

source: إذا السماء انفطرت
en: When the heaven is cleft asunder,

source: وإذا الكواكب انتثرت
en: When the planets are dispersed,

source: وإذا البحار فجرت
en: When the seas are poured forth,

source: وإذا القبور بعثرت
en: And the sepulchres are overturned,

source: علمت نفس ما قدمت وأخرت
en: A soul will know what it hath sent before (it) and what left behind.

source: يا أيها الإنسان ما غرك بربك الكريم
en: O man! What hath made thee careless concerning thy Lord, the Bountiful,

source: الذي خلقك فسواك فعدلك
en: Who created thee, then fashioned, then proportioned thee?

source: في أي صورة ما شاء ركبك
en: Into whatsoever form He will, He casteth thee.

source: كلا بل تكذبون بالدين
en: Nay, but ye deny the Judgment.

source: وإن عليكم لحافظين
en: Lo! there are above you guardians,

source: كراما كاتبين
en: Generous and recording,

source: يعلمون ما تفعلون
en: Who know (all) that ye do.

source: إن الأبرار لفي نعيم
en: Lo! the righteous verily will be in delight.

source: وإن الفجار لفي جحيم
en: And lo! the wicked verily will be in hell;

source: يصلونها يوم الدين
en: They will burn therein on the Day of Judgment,

source: وما هم عنها بغائبين
en: And will not be absent thence.

source: وما أدراك ما يوم الدين
en: Ah, what will convey unto thee what the Day of Judgment is!

source: ثم ما أدراك ما يوم الدين
en: Again, what will convey unto thee what the Day of Judgment is!

source: يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله
en: A day on which no soul hath power at all for any (other) soul. The (absolute) command on that day is Allah's.

source: ويل للمطففين
en: Woe unto the defrauders:

source: الذين إذا اكتالوا على الناس يستوفون
en: Those who when they take the measure from mankind demand it full,

source: وإذا كالوهم أو وزنوهم يخسرون
en: But if they measure unto them or weight for them, they cause them loss.

source: ألا يظن أولئك أنهم مبعوثون
en: Do such (men) not consider that they will be raised again

source: ليوم عظيم
en: Unto an Awful Day,

source: يوم يقوم الناس لرب العالمين
en: The day when (all) mankind stand before the Lord of the Worlds?

source: كلا إن كتاب الفجار لفي سجين
en: Nay, but the record of the vile is in Sijjin -

source: وما أدراك ما سجين
en: Ah! what will convey unto thee what Sijjin is! -

source: كتاب مرقوم
en: A written record.

source: الذين يكذبون بيوم الدين
en: Those who deny the Day of Judgment

source: وما يكذب به إلا كل معتد أثيم
en: Which none denieth save each criminal transgressor,

source: كلا بل ران على قلوبهم ما كانوا يكسبون
en: Nay, but that which they have earned is rust upon their hearts.

source: كلا إنهم عن ربهم يومئذ لمحجوبون
en: Nay, but surely on that day they will be covered from (the mercy of) their Lord.

source: ثم إنهم لصالو الجحيم
en: Then lo! they verily will burn in hell,

source: ثم يقال هذا الذي كنتم به تكذبون
en: And it will be said (unto them): This is that which ye used to deny.

source: كلا إن كتاب الأبرار لفي عليين
en: Nay, but the record of the righteous is in 'Illiyin -

source: وما أدراك ما عليون
en: Ah, what will convey unto thee what 'Illiyin is! -

source: يشهده المقربون
en: Attested by those who are brought near (unto their Lord).

source: على الأرائك ينظرون
en: On couches, gazing,

source: تعرف في وجوههم نضرة النعيم
en: Thou wilt know in their faces the radiance of delight.

source: يسقون من رحيق مختوم
en: They are given to drink of a pure wine, sealed,

source: ختامه مسك وفي ذلك فليتنافس المتنافسون
en: Whose seal is musk - for this let (all) those strive who strive for bliss -

source: ومزاجه من تسنيم
en: And mixed with water of Tasnim,

source: عينا يشرب بها المقربون
en: A spring whence those brought near (to Allah) drink.

source: إن الذين أجرموا كانوا من الذين آمنوا يضحكون
en: Lo! the guilty used to laugh at those who believed,

source: وإذا مروا بهم يتغامزون
en: And wink one to another when they passed them;

source: وإذا انقلبوا إلى أهلهم انقلبوا فكهين
en: And when they returned to their own folk, they returned jesting;

source: وإذا رأوهم قالوا إن هؤلاء لضالون
en: And when they saw them they said: Lo! these have gone astray.

source: وما أرسلوا عليهم حافظين
en: Yet they were not sent as guardians over them.

source: فاليوم الذين آمنوا من الكفار يضحكون
en: This day it is those who believe who have the laugh of disbelievers,

source: هل ثوب الكفار ما كانوا يفعلون
en: Are not the disbelievers paid for what they used to do?

source: إذا السماء انشقت
en: When the heaven is split asunder

source: وأذنت لربها وحقت
en: And attentive to her Lord in fear,

source: وإذا الأرض مدت
en: And when the earth is spread out

source: وألقت ما فيها وتخلت
en: And hath cast out all that was in her, and is empty

source: يا أيها الإنسان إنك كادح إلى ربك كدحا فملاقيه
en: Thou, verily, O man, art working toward thy Lord a work which thou wilt meet (in His presence).

source: فأما من أوتي كتابه بيمينه
en: Then whoso is given his account in his right hand

source: فسوف يحاسب حسابا يسيرا
en: He truly will receive an easy reckoning

source: وينقلب إلى أهله مسرورا
en: And will return unto his folk in joy.

source: وأما من أوتي كتابه وراء ظهره
en: But whoso is given his account behind his back,

source: فسوف يدعو ثبورا
en: He surely will invoke destruction

source: ويصلى سعيرا
en: And be thrown to scorching fire.

source: إنه كان في أهله مسرورا
en: He verily lived joyous with his folk,

source: إنه ظن أن لن يحور
en: He verily deemed that he would never return (unto Allah).

source: بلى إن ربه كان به بصيرا
en: Nay, but lo! his Lord is ever looking on him!

source: فلا أقسم بالشفق
en: Oh, I swear by the afterglow of sunset,

source: والليل وما وسق
en: And by the night and all that it enshroudeth,

source: والقمر إذا اتسق
en: And by the moon when she is at the full,

source: لتركبن طبقا عن طبق
en: That ye shall journey on from plane to plane.

source: فما لهم لا يؤمنون
en: What aileth them, then, that they believe not

source: وإذا قرئ عليهم القرآن لا يسجدون
en: And, when the Qur'an is recited unto them, worship not (Allah)?

source: بل الذين كفروا يكذبون
en: Nay, but those who disbelieve will deny;

source: والله أعلم بما يوعون
en: And Allah knoweth best what they are hiding.

source: فبشرهم بعذاب أليم
en: So give them tidings of a painful doom,

source: إلا الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون
en: Save those who believe and do good works, for theirs is a reward unfailing.

source: والسماء ذات البروج
en: By the heaven, holding mansions of the stars,

source: واليوم الموعود
en: And by the Promised Day.

source: وشاهد ومشهود
en: And by the witness and that whereunto he beareth testimony,

source: قتل أصحاب الأخدود
en: (Self-)destroyed were the owners of the ditch

source: النار ذات الوقود
en: Of the fuel-fed fire,

source: إذ هم عليها قعود
en: When they sat by it,

source: وهم على ما يفعلون بالمؤمنين شهود
en: And were themselves the witnesses of what they did to the believers.

source: وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد
en: They had naught against them save that they believed in Allah, the Mighty, the Owner of Praise,

source: الذي له ملك السماوات والأرض والله على كل شيء شهيد
en: Him unto Whom belongeth the Sovereignty of the heavens and the earth; and Allah is of all things the Witness.

source: إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا فلهم عذاب جهنم ولهم عذاب الحريق
en: Lo! they who persecute believing men and believing women and repent not, theirs verily will be the doom of hell, and theirs the doom of burning.

source: إن الذين آمنوا وعملوا الصالحات لهم جنات تجري من تحتها الأنهار ذلك الفوز الكبير
en: Lo! those who believe and do good works, theirs will be Gardens underneath which rivers flow. That is the Great Success.

source: إن بطش ربك لشديد
en: Lo! the punishment of thy Lord is stern.

source: إنه هو يبدئ ويعيد
en: Lo! He it is Who produceth, then reproduceth,

source: وهو الغفور الودود
en: And He is the Forgiving, the Loving,

source: ذو العرش المجيد
en: Lord of the Throne of Glory,

source: فعال لما يريد
en: Doer of what He will.

source: هل أتاك حديث الجنود
en: Hath there come unto thee the story of the hosts

source: فرعون وثمود
en: Of Pharaoh and (the tribe of) Thamud?

source: بل الذين كفروا في تكذيب
en: Nay, but those who disbelieve live in denial

source: والله من ورائهم محيط
en: And Allah, all unseen, surroundeth them.

source: بل هو قرآن مجيد
en: Nay, but it is a glorious Qur'an.

source: في لوح محفوظ
en: On a guarded tablet.

source: والسماء والطارق
en: By the heaven and the Morning Star

source: وما أدراك ما الطارق
en: - Ah, what will tell thee what the Morning Star is!

source: النجم الثاقب
en: - The piercing Star!

source: إن كل نفس لما عليها حافظ
en: No human soul but hath a guardian over it.

source: فلينظر الإنسان مم خلق
en: So let man consider from what he is created.

source: خلق من ماء دافق
en: He is created from a gushing fluid

source: يخرج من بين الصلب والترائب
en: That issued from between the loins and ribs.

source: إنه على رجعه لقادر
en: Lo! He verily is Able to return him (unto life)

source: يوم تبلى السرائر
en: On the day when hidden thoughts shall be searched out.

source: فما له من قوة ولا ناصر
en: Then will he have no might nor any helper.

source: والسماء ذات الرجع
en: By the heaven which giveth the returning rain,

source: والأرض ذات الصدع
en: And the earth which splitteth (with the growth of trees and plants)

source: إنه لقول فصل
en: Lo! this (Qur'an) is a conclusive word,

source: وما هو بالهزل
en: It is no pleasantry.

source: إنهم يكيدون كيدا
en: Lo! they plot a plot (against thee, O Muhammad)

source: وأكيد كيدا
en: And I plot a plot (against them).

source: فمهل الكافرين أمهلهم رويدا
en: So give a respite to the disbelievers. Deal thou gently with them for a while.

source: سبح اسم ربك الأعلى
en: Praise the name of thy Lord the Most High,

source: الذي خلق فسوى
en: Who createth, then disposeth;

source: والذي قدر فهدى
en: Who measureth, then guideth;

source: والذي أخرج المرعى
en: Who bringeth forth the pasturage,

source: فجعله غثاء أحوى
en: Then turneth it to russet stubble.

source: سنقرئك فلا تنسى
en: We shall make thee read (O Muhammad) so that thou shalt not forget

source: إلا ما شاء الله إنه يعلم الجهر وما يخفى
en: Save that which Allah willeth. Lo! He knoweth the disclosed and that which still is hidden;

source: ونيسرك لليسرى
en: And We shall ease thy way unto the state of ease.

source: فذكر إن نفعت الذكرى
en: Therefor remind (men), for of use is the reminder.

source: سيذكر من يخشى
en: He will heed who feareth,

source: ويتجنبها الأشقى
en: But the most hapless will flout it,

source: الذي يصلى النار الكبرى
en: He who will be flung to the great Fire

source: ثم لا يموت فيها ولا يحيى
en: Wherein he will neither die nor live.

source: قد أفلح من تزكى
en: He is successful who groweth,

source: وذكر اسم ربه فصلى
en: And remembereth the name of his Lord, so prayeth,

source: بل تؤثرون الحياة الدنيا
en: But ye prefer the life of the world

source: والآخرة خير وأبقى
en: Although the Hereafter is better and more lasting.

source: إن هذا لفي الصحف الأولى
en: Lo! This is in the former scrolls.

source: صحف إبراهيم وموسى
en: The Books of Abraham and Moses.

source: هل أتاك حديث الغاشية
en: Hath there come unto thee tidings of the Overwhelming?

source: وجوه يومئذ خاشعة
en: On that day (many) faces will be downcast,

source: عاملة ناصبة
en: Toiling, weary,

source: تصلى نارا حامية
en: Scorched by burning fire,

source: تسقى من عين آنية
en: Drinking from a boiling spring,

source: ليس لهم طعام إلا من ضريع
en: No food for them save bitter thorn-fruit

source: لا يسمن ولا يغني من جوع
en: Which doth not nourish nor release from hunger.

source: وجوه يومئذ ناعمة
en: In that day other faces will be calm,

source: لسعيها راضية
en: Glad for their effort past,

source: لا تسمع فيها لاغية
en: Where they hear no idle speech,

source: فيها عين جارية
en: Wherein is a gushing spring,

source: فيها سرر مرفوعة
en: Wherein are couches raised

source: وأكواب موضوعة
en: And goblets set at hand

source: ونمارق مصفوفة
en: And cushions ranged

source: وزرابي مبثوثة
en: And silken carpets spread.

source: أفلا ينظرون إلى الإبل كيف خلقت
en: Will they not regard the camels, how they are created?

source: وإلى السماء كيف رفعت
en: And the heaven, how it is raised?

source: وإلى الجبال كيف نصبت
en: And the hills, how they are set up?

source: وإلى الأرض كيف سطحت
en: And the earth, how it is spread?

source: فذكر إنما أنت مذكر
en: Remind them, for thou art but a remembrancer,

source: لست عليهم بمصيطر
en: Thou art not at all a warder over them.

source: إلا من تولى وكفر
en: But whoso is averse and disbelieveth,

source: فيعذبه الله العذاب الأكبر
en: Allah will punish him with direst punishment.

source: إن إلينا إيابهم
en: Lo! unto Us is their return

source: ثم إن علينا حسابهم
en: And Ours their reckoning.

source: والفجر
en: By the Dawn

source: وليال عشر
en: And ten nights,
